app/commands/authorize_api_request.rb

    def author
      @author ||= Author.find(decoded_auth_token[:author_id]) if decoded_auth_token
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]