app/commands/authenticate_author.rb

    def author
      author = Author.find_by_email(email)
---
SELECT "authors".* FROM "authors" WHERE "authors"."email" = ? LIMIT ?  [["email", "tsguha@gmail.com"], ["LIMIT", 1]]