app/controllers/article_controller.rb

SELECT categories.*,authors.name,authors.author_img,articles.* FROM "articles" INNER JOIN "authors" ON "authors"."id" = "articles"."author_id" INNER JOIN "categories" ON "categories"."id" = "articles"."category_id"
---
    def show
        @Article = Article.joins(:author,:category).select("categories.*,authors.name,authors.author_img,articles.*")

INSERT INTO "articles" ("title", "article_text", "article_img", "description", "likes", "duration", "author_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @Article = Article.create(title:params[:title],article_text:params[:article_text],article_img:params[:article_img],description:params[:description],likes:params[:likes],duration:params[:duration],author_id:params[:author_id],category_id:params[:category_id])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def byid
        @Article = Article.joins(:author,:category).select("categories.*,authors.*,articles.*")
        @Article = @Article.find(params[:id])