app/controllers/author_controller.rb

    def index
        @Author = Author.all
---
SELECT "authors".* FROM "authors"